Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode.CanConnectToUpstreamNode(Autodesk.Revit.DB.ElementId)
Verifies that the current node can connect to the upstream node.
upstreamNodeId:
The upstream node id.
Returns:
True if the current node can connect to the upstream node.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The analytical distribution node is full of downstream nodes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The analytical distribution node is full of upstream nodes.
Since:
2023